// 1.Запитайте у юзера скільки йому років:"Привіт мені - " " років"
let age = +prompt("Скільки тобі років?");
alert(`Привіт! Мені ${age} років`);

//2.Запитайтесь якого року народження юзер, теперішній рік візьмемо за константу.Виведемо скільки йому років.
const YEAR = 2020;
let yourBirthYear = +prompt("Який твій рік народження?");
let yourAge = YEAR - yourBirthYear;
alert(`Твій рік народження ${yourAge}`);

//3. Запитайтесь у юзера довжини сторін прямокутника та виведіть його периметр.a1
let a = +prompt("Довжина a");
let b = +prompt("Ширина b");
let p = 2 * a + 2 * b;
alert(`Периметр прямокутника ${p}`);

//4.Запитайтесь в юзера радіус кола та виведіть його площу.(число пі)
let r = +prompt("Який радіус кола?");
let pi = 3.14;
let square = pi * r ** 2;
alert(`Площа кола ${square}.`);

// 5. Водій їде з середньою швидкістю 50 км в годину. Запитайтесь у нього скільки щейому необхідно часу їхати, та виведіть відстань
let speed = 50;
let time = +prompt("Скільки хвилин тобі їхати?");
let answer = speed * time;
alert(`Тобі їхати ${answer} км`);

//6. Реалізуємо конвертер кілометрів в милі і навпаки =)
let km = +prompt("Введіть кількість кілометрів?");
let relation = 1.609344;
alert(`${km / relation} миль.`);
let mile = +prompt("Введіть кількість миль?");
alert(`${mile * relation} км.`);

//7. Юзер вводить скільки коштів на його картці та ціну одного літра бензину. Виводимо скільки бензину він може купити та скільки грошей у нього залишиться.
let money = +prompt("Введіть залишок на рахунку?");
let price = +prompt("Введіть ціну одного літра бензину?");
let numberOfLiters = Math.floor(money / price);
let remainder = money % price;
alert(
  `Ти можеш купити ${numberOfLiters} літер і в тебе залишиться ${remainder}.`
);
